app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("created_at", "eventid", "updated_at", "userid") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-07 07:01:16.771016"], ["eventid", 1], ["updated_at", "2014-11-07 07:01:16.771016"], ["userid", 1]]
---
  def new
  	#render :text => params.inspect
  	@booking=Booking.new('userid' => current_user.id, 'eventid' => params[:event])
  	@booking.save