app/controllers/mainevents_controller.rb

  def index
    @mainevents = Mainevent.all
---
SELECT "mainevents".* FROM "mainevents"

  def create
    @mainevent = Mainevent.new(mainevent_params)
    @mainevent.save
---
INSERT INTO "mainevents" ("created_at", "date", "description", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @mainevent.update(mainevent_params)
---
UPDATE "mainevents" SET "date" = ?, "updated_at" = ? WHERE "mainevents"."id" = 7  [["date", "2014-11-10 16:30:00.000000"], ["updated_at", "2014-11-07 07:39:19.562591"]]

  def destroy
    @mainevent.destroy
---
DELETE FROM "mainevents" WHERE "mainevents"."id" = ?  [["id", 1]]

    def set_mainevent
      @mainevent = Mainevent.find(params[:id])
---
SELECT  "mainevents".* FROM "mainevents"  WHERE "mainevents"."id" = ? LIMIT 1  [["id", 3]]