app/controllers/site_controller.rb

SELECT "bookings".* FROM "bookings"  WHERE "bookings"."userid" = 1
SELECT "mainevents".* FROM "mainevents"
---
  def profile
  	@bookings = Booking.where(:userid => current_user.id)
  	@mainevents = Mainevent.all